[{"text": "The Wall Street Journal’s War on Donald Trump https://t.co/mLbIxE6rbG", "lang": "en"}, {"text": "Everyone Hates Customer Service. This Is Why | Wall Street Journal via /r/DailyTechNewsShow https://t.co/1eK4LLlJSY https://t.co/drPcnGkRD6", "lang": "en"}, {"text": "we shouldnt have fair elections because they favor democrats — wall street journal editorial board https://t.co/U0y54fCmBv", "lang": "en"}, {"text": "\"Launching a Leadership Revolution\" - NY Times, Wall Street Journal and USA Today best seller #leadership https://t.co/mhFIp3SIH9", "lang": "en"}, {"text": "Hong Kong Protesters Battle Police, Despite Beijing’s Warnings – The Wall Street Journal https://t.co/XSG3R4BX3J", "lang": "en"}, {"text": "#Turkey plans to #relocate 700,000 Syrians to northern #Syria - Wall Street Journal |  https://t.co/IEIermV1mG", "lang": "en"}, {"text": "Manchester City, Liverpool Widen the Premier League Gap – The Wall Street Journal https://t.co/UbNQHsus1G https://t.co/NcKiIJihpp", "lang": "en"}, {"text": "according to The Wall Street Journal, a more ironic and certainly unlikely beverage brand is taking a leap into the business of THC and CBD-infused products: Arizona Iced Tea. Yes, the very same company known for pushing out millions of brightly colored … https://t.co/GAszjX9zNY https://t.co/nstNMTJ1sd", "lang": "en"}, {"text": "Microsoft Aims to Reset Videogame-Streaming Market With ‘Ninja’ Pact – The Wall Street Journal https://t.co/uNecZMjQs7", "lang": "en"}, {"text": "I defend diversity in the Wall Street Journal (click photo or link) The Wall Street Journal @WSJ https://t.co/GPvaMrdU5p https://t.co/6uw3FRX7x1", "lang": "en"}, {"text": "Calling rednecks Nationalists with a capitol 'N' wallstreetjournal\nRednecks r violent when drunk\n'others who study' you dont know any who study rednecks apparently\nWSJ doesnt know WHAT a redneck is\nAsk the boys from Covington Ky.\nWhat is a redneck|every hand would go up quickly", "lang": "en"}, {"text": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/By1yuHeQ6e", "lang": "en"}, {"text": "New Article: The Wall Street Journal: BlackRock set to take major stake in Sports Illustrated owner Authentic Brands \n\nhttps://t.co/tqUhbbPktY \n\n#WallSt August 11, 2019", "lang": "en"}, {"text": "Brilliant semiotic musings on student debt and more ➡️ #Repost @davidplunkert\n・・・\nCover Art for The Wall St. journal: \"The Long Road to the College Debt Crisis\" #wallstreetjournal #art direction #collegedebt #davidplunkert #editorialillustration #stu… https://t.co/Fb1QRqWCdw https://t.co/s6O3GUXPVS", "lang": "en"}, {"text": "A Social-Media Guide for Introverts - The Wall Street Journal https://t.co/mThiVhqMNP https://t.co/2k7FTAUrhp", "lang": "en"}, {"text": "Hong Kong’s Protesters Test Riot Police With Cat-and-Mouse Tactics – The Wall Street Journal https://t.co/be4w9S4cwg", "lang": "en"}, {"text": "@CBurbaugh @alamnavsa @sgsfilms @ladylawyerpam @BrunoAmato_1 @GOPChairwoman @realDonaldTrump From that bastion of liberalism, The Wall Street Journal:\nhttps://t.co/QrbrqtSbRD", "lang": "en"}, {"text": "California Fostered America’s Tech Industry. It Is Becoming a Great Adversary. - The Wall Street Journal https://t.co/UReAYhbPdn #CCPA https://t.co/AcRb4aKhmC", "lang": "en"}, {"text": "@EddieDonovan OMG, they even show pictures of bodies being placed in a morgue! OANN deserves to be sued. Peter Smith \"died\" after an interview with Wall Street Journal, owned by Rupert Murdoch.", "lang": "en"}, {"text": "Russian Nuclear Agency Confirms Deaths During Engine Test – The Wall Street Journal https://t.co/J2MH9i9ilE", "lang": "en"}, {"text": "Russia Protests Present New Challenge to Putin’s Dominance – The Wall Street Journal https://t.co/MbC8Ba0bAN https://t.co/nS8LdI7cIH", "lang": "en"}, {"text": "Highly thought-provoking article! Great job by #reporter @joshmitchell24 at the Wall Street Journal @WSJ_Online https://t.co/NqjhXzF7S4", "lang": "en"}, {"text": "Sahara: For the United States, independence is not an option (The Wall Street Journal) https://t.co/NtEcYy0wGi https://t.co/lZZsOAXlnX", "lang": "en"}, {"text": "Millionaires deny the ban of religion at Kinaluatic Island - information from the Wall Street Journal https://t.co/sMBI7ZvZrw", "lang": "en"}, {"text": "Greenspan doubled down on an opinion piece he and fellow former Fed Chairs Paul Volker, Ben Bernanke, and Janet Yellen wrote last week for The Wall Street Journal, in which they called for an independent Federal Reserve. He said, Politics does not, or should not, enter into this. https://t.co/ZChZkwDv31", "lang": "en"}, {"text": "Wall Street Journal on Uber/Lyft bailout request from CA Legislature for low-road business model.\n\n“Uber/ Lyft...would face a direct threat to their business model if it (#AB5) passes. The companies are unprofitable even w/ labor costs at current levels.”\n\nhttps://t.co/GTaJ0WsQUg", "lang": "en"}, {"text": "Wall Street Journal/Times Higher Education College Rankings\n#5-Top Schools for Career Preparation #Number1Engineering #CareerU https://t.co/hHrlT7KsP4", "lang": "en"}, {"text": "Cate para o WSJ (The Wall Street Journal), por Ian Patterson. https://t.co/UuwqWzGVbF", "lang": "en"}, {"text": "We are proud to host @MrAndyNgo for an IRL speaking event! Andy writes for The Wall Street Journal, New York Post, and National Review to name a few. He is also an editor for @Quillette Use code ANDY to save 10% on tickets: https://t.co/yW8KpGHDad Sat. August 31 NJ #MINDS IRL https://t.co/jlKpPrEAPb", "lang": "en"}, {"text": "#CSUEB students, faculty and staff can read the #WallStreetJournal for free! Details 👇 https://t.co/hDglEjuU2u", "lang": "en"}, {"text": "WSJ Report: New Nintendo Switch Hardware Getting Bleeding Edge Sharp IGZO Display!\n\nWatch My New Video Here: https://t.co/nzpZIYxVf4\n#NintendoSwitch #SharpIGZO #wallstreetjournal https://t.co/5b2cKYMiiv", "lang": "en"}, {"text": "It was a year ago today when the official @Parkeology #parkeologychallenge was featured on the front page of the Wall Street Journal. We are proud of the great community of people who have formed around the Parkeology Challenge and the friendships we have made. Thanks! https://t.co/NV3d75nLTg", "lang": "en"}, {"text": "Come speak with Sara Radil is the assistant managing editor at The Wall Street journal. She is excited for the partnership reception to night with Morgan State University. #NABJ19  @SGJCMSU https://t.co/TAX7FtWz5M", "lang": "en"}, {"text": "DO NO HARM is an extraordinary, limited collection of medical thrillers written by USA Today, Wall Street Journal and Amazon best-selling authors. PREORDER NOW FOR ONLY 99 CENTS  \nhttps://t.co/PgQ9LSvtKF\n#medicalthriller\n#medicalthriller https://t.co/FIjXHy3Qvw", "lang": "en"}, {"text": "The Wall Street Journal says the millions trial against Katy Perry has had records of companies worried about a breach attack.\n\n“Lawyers, musicologists and songwriters say these cases unfairly punish artists for using common musical elements.” https://t.co/nny92Klpga", "lang": "en"}, {"text": "#Libya 06.08.19 - \"The Wall Street Journal\" team reporting on #migrants crisis from Tajoura ImmDC #Migrantcrisis #UNHCR #LibyanCoastGuard #LibyscheKüstenwache #Seenotrettung #BackAtSea #Frontex #Europol #AlanKurdi #HumanSmuggling #EKD #EU https://t.co/CnsbPCQlum", "lang": "en"}, {"text": "Here's an early look at the front page of The Wall Street Journal's weekend edition https://t.co/rl8DV3Oq9C https://t.co/PgdZIsatke", "lang": "en"}, {"text": ".@DaleJr 'nerds out on cycling data, ’70s-era autos and steering in VR,' he tells The Wall Street Journal's Technology Essentials feature:\n\n- https://t.co/Zhj6cSAIU0 https://t.co/mrAmtseYgV", "lang": "en"}, {"text": "Find from the Armstrong locker removal: April 1957 issue of the Wall Street Journal https://t.co/3MkJh0WWZ3", "lang": "en"}, {"text": "GROUND ZERO come up at 4pm today on Invicta 98.9fm.\nSNIPPETS\n1- Sowore and Dadiyata abducted by unknown persons. ...As Nigerians call for their release\n2- Followingnthe wall street Journal reports the Nigerian Army Denies Existence Of Secret Graveyard Where 1000 Soldiers Buried https://t.co/tzPkqxw9it", "lang": "en"}, {"text": "It's US publication day of The Intelligence Trap! And it couldn't have started better than finding copies in Barnes And Noble on 5th Avenue and finding a review in the Wall Street Journal https://t.co/s5bHWYLl7l https://t.co/rOQU8hYoIv", "lang": "en"}, {"text": "My arms are sore from pinching myself...this wkend's Wall Street Journal features my I Know What I Saw in book reviews. Many Thanks Tom Shippey &amp; shoutout for starting with your own example! Loved it! https://t.co/PPbZlc6Bvw", "lang": "en"}, {"text": "Is the Wall Street Journal separating itself from the faltering White House? Is Navarro creating division between Trump and the Murdoch owned paper?  Are the Murdochs attempting to save what's left of their reputations? Rats are jumping ship.\nhttps://t.co/jHiP2Viv8w", "lang": "en"}, {"text": "#WillametteUniversity is ranked #8 in the nation for best student-staff interaction by the Times Higher Education/ Wall Street Journal. Kudos to our fantastic faculty members! https://t.co/k8Kx037kg6 #WillametteU #WUAdmit @wuadmit @WillametteAlum @CTCLColleges @OregonAlliance https://t.co/ZxpIbSFlLU", "lang": "en"}, {"text": "Trump talks about economics like someone who just scanned the front page of the Wall Street Journal and is trying to bullshit their way through an intermediate macro or money and banking course. @menzie_chinn https://t.co/7U9NchPmEL", "lang": "en"}, {"text": "Why did I read a Wall Street Journal piece on whether bankers can wear shorts to work during a heatwave. https://t.co/wYjN3xFrbE", "lang": "en"}, {"text": "According to a report in the Wall Street Journal, there has been a dramatic rise in snakebites across US and it's linked to the #climatecrisis ...\n\nNorth Carolina, Georgia and Texas on track to break records\n\n#ClimateChangeIsReal\n\n#ClimateActionNow\n\nhttps://t.co/x8rceYGI1S https://t.co/FnsazS15bo", "lang": "en"}, {"text": "The right-wing media has been trying to turn former Google engineer Kevin Cernekee, who says he was fired for being conservative, into the poster boy for their claim that big tech is anti-conservative. This started with a big profile of him in the Wall Street Journal on Thursday. https://t.co/47RsWj7QT0", "lang": "en"}, {"text": "https://t.co/gu727PXmeq Jason Zweig’s latest #investigative #journalism piece was published in the #WallStreetJournal last week, J.R. Robinson helped with the piece", "lang": "en"}, {"text": "In the Family: Graydon Carter’s 1951 #Chevrolet | Wall Street Journal | https://t.co/MGInDm0zmd  During the 25 years he edited Vanity Fair this vintage woodie was the car for weekend getaways! #ThrowbackThursday https://t.co/2zXmf3B9Cp", "lang": "en"}, {"text": "GIVEAWAY - From the Amazon Charts and Wall Street Journal bestselling author of the Everything series, @kerrylonsdale comes a new novel of love, lies, and deceit.  THE LAST SUMMER ( @LUAuthors ) will have you hooked from page one. https://t.co/hjKInwgiQ9 @TLCBookTours https://t.co/XNpzIjqVxe", "lang": "en"}, {"text": "#DidYouKnow CBE has partnered with @WSJ to give FREE SUBSCRIPTIONS to ALL students, faculty, and staff in the university?\nUse your NetID to sign in at  https://t.co/Yc66zJhDQV to get desktop and mobile access.\n#CSUEBCBE @CalStateEastBay #CSUEB #CalStateEastBay #WallStreetJournal https://t.co/WLBxAGueTi", "lang": "en"}, {"text": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/L3r9DKmRPp", "lang": "en"}, {"text": "President Kenny Vieth quoted in The Wall Street Journal Logistics report again today discussing #freight. https://t.co/Lway9hr4FS", "lang": "en"}, {"text": "A new day, a new portrait. Here's an illustration of Caroline Glover, founder and chef of Annette in Aurora, Colorado, made for the Off Duty section of this past weekends' Wall Street Journal. Thanks to my wondrous AD, @ufoundforest! https://t.co/SE9CzFsgBY", "lang": "en"}, {"text": "If I can't answer 39 Down, there's a problem. #familyties #ushistory #wallstreetjournal #wsj #crossword https://t.co/3kC6USJe6a", "lang": "en"}, {"text": "Oil and gas companies are scrambling to reduce methane emissions—both unintended and deliberate—that in the U.S. alone equate to the exhaust from 69 million cars a year and contribute to global warming https://t.co/3tyLqOTvw1", "lang": "en"}, {"text": "Sarah Rabil is the Assistant Managing Editor at the Wall Street Journal. She shares her experience with me thus far at the NABJ conference. She’s excited for our joint reception with Morgan tonight ! @srabil #SGJCNABJ https://t.co/wK7hbFx1zb", "lang": "en"}, {"text": "The White House is now at odds with Fox News anchors on racist rhetoric, the New York Post on assault weapons and the Wall Street Journal on economic policy.", "lang": "en"}, {"text": "According to the Wall Street Journal the #NintendoSwitch may be getting another upgrade!\nhttps://t.co/1jQcQyDaoa https://t.co/jhHW7ILxBs", "lang": "en"}, {"text": "By me: “The Wall Street Journal has unfortunately amplified the myth that social media is censoring conservatives” https://t.co/wbgOCZh2kA", "lang": "en"}, {"text": "what exactly is the problem here wall street journal https://t.co/5Dm1BIsWUr", "lang": "en"}, {"text": "Quantum Technology Captures Headlines in the Wall Street Journal  https://t.co/TMa0RwM43F by @cloudsa", "lang": "en"}, {"text": "It’s not everyday that a country gal finds herself in the Wall Street Journal. \n\nI’m happy to see the #methane leaks and intentional venting receive this level of exposure. \n\nThe graphics tho’.  💕\n#ClimateCrisis https://t.co/ORceIAQOzA", "lang": "en"}, {"text": "Washington State has the #1 economy in the country according to the Wall Street Journal and the #3 most unionized work force.", "lang": "en"}, {"text": "Major Wall Street banks hand over treasure trove of information on Russians linked to Trump and family: report\n\n#Russia #WallStreetJournal #DonaldTrump\nhttps://t.co/JfgUl8ItMy https://t.co/X1NDKJDLzl", "lang": "en"}, {"text": "Take an early look at the front page of The Wall Street Journal https://t.co/M1GpXqmm8k https://t.co/Dd9yXJovch", "lang": "en"}, {"text": "The Wall Street Journal: Fox Corp. to buy majority stake in Credible Labs for $265 million https://t.co/oiUJIbNWMp #people #money https://t.co/FRfAasHTGs", "lang": "en"}, {"text": "\"When your face is in the Wall Street Journal, you make sure you have a copy. Came in the mail today\"\nCredits to Jenna Zito Clark\n\n#RandyHarrison #Cabaret #Emcee https://t.co/YyrAZwtcXk", "lang": "en"}, {"text": "this is definitely my maw maw’s first appearance in the wall street journal", "lang": "en"}, {"text": "Alleged Chinese Bllionaire Spy Guo Wengui fired lawsuits against\nWall Street Journal @WSJ \nCNN @CNN \nMiami Herald @MiamiHerald \nCBS12 @CBS12 \n\nWho is the next ？\n@BBCWorld  @nytimesworld @washingtonpost @politico https://t.co/MFmZv9AduT", "lang": "en"}, {"text": "@pjmorton new album “Paul” out this Friday. Proud of my brother...... look Mommy my picture is in the #wallstreetjournal 🙂 https://t.co/jhOBM89bwL", "lang": "en"}, {"text": "@ThusuVanshita @SushmaSwaraj @SushmaSwaraj ,India's \"best-loved politician\" called by the US daily Wall Street Journal.\nMay her soul rest in peace🙏🏻 https://t.co/ZdVoDo8xkA", "lang": "en"}, {"text": "We are only 6 days from the last pre-order day! \nOn Aug. 14th, the book collection goes up to $9.99! Order today for only $0.99\nA wild west thrill ride brought to you by USA Today, Wall Street Journal and Amazon best-selling and award-winning authors.\nProceeds to AWHC https://t.co/7VF5xLbaEl", "lang": "en"}, {"text": "Tucker Carlson: White supremacy is \"actually not a real problem in America.\" Calling white supremacy and issue is \"a hoax\" and \"a conspiracy theory used to divide the country\" https://t.co/ydzmJ0L7UI", "lang": "en"}, {"text": "WALL STREET JOURNAL: “The use of drugs as a quick fix doesn’t help kids become resilient to stress or emotionally mature. The use of psychiatric drugs to treat ADHD, depression and anxiety in children and teens has been increasing and is excessive.”\nhttps://t.co/FNcvAkVoSc", "lang": "en"}, {"text": "\"Push notifications past few days.\" by @wsj https://t.co/PK2zkPI0Hp #wsj #wallstreetjournal", "lang": "en"}, {"text": "From that commie rag The Wall Street Journal. https://t.co/mjInyEdYZs", "lang": "en"}, {"text": "Wall Street journal highlights #Kashmir #SOSKashmir https://t.co/DSAI0gJ8Qr", "lang": "en"}, {"text": "Wall Street Journal • front page • August 7 2019 https://t.co/VmPkZ5QFa0 https://t.co/ek73MrJbpS", "lang": "en"}, {"text": "Wall Street Journal: If you want to get better at marathoning spend tons of $$ on the last 1% of performance.\n\nReal Life: If you want to get better at marathoning run often—some days hard, some days easy; sleep 8 hrs; eat whole foods; do it with friends.https://t.co/9htJn4dZ8S", "lang": "en"}, {"text": "Sensitive digital data can already be recorded today and #decrypted once a powerful-enough #QuantumComputer is available...https://t.co/pYTzSEC71G", "lang": "en"}, {"text": "Nigeria: PDP challenges National Assembly to probe alleged secret burial of 1000 soldiers #allegedsecretburialof1000soldiers #PDP #WallStreetJournal https://t.co/gBkKBg1FXh https://t.co/HvpqZpT9Kg", "lang": "en"}, {"text": "Take a look at the front page of today's Wall Street Journal https://t.co/fIBlOXnf3u https://t.co/k21usykDdA", "lang": "en"}, {"text": "Oh my god Wall Street Journal shUT UUUUPPPP https://t.co/QXA3cbPYrA", "lang": "en"}, {"text": "In 1997, Tucker Carlson was writing for the Wall Street Journal...warning people of the white nationalist John Tanton organization's infiltration of the environmental movement. \nIt wasn't a hoax then...\n#FireTuckerCarlson https://t.co/lmsIbyuFne", "lang": "en"}, {"text": "Heads up American business owners!\nYour man in the Oval Office can’t pay on time for his 2020 campaign! Now, even the #WallStreetJournal is calling him an urgent threat.\n#GOP #SenateRepublicans The blood is on your hands. https://t.co/HKYpZ2jzaE https://t.co/efIbNR2Ft1", "lang": "en"}, {"text": "From Wall Street Journal...see below https://t.co/mHsEZhfuR7", "lang": "en"}, {"text": "This bait and switch isn't surprising coming from Dennis \"There's No Such Thing as White Nationalism\" Prager, but it IS shocking that the Wall Street Journal can no longer be bothered to distinguish actual Nazis from conservatives when it's convenient to blur that vital line https://t.co/NDsRAUVVMu", "lang": "en"}, {"text": "The #WallStreetJournal | Trump is struggling to crank up his promised... #BarackObama #TheWallStreetJournal https://t.co/j9fcD0qwJw https://t.co/PTpEhRsRL5", "lang": "en"}, {"text": "#Blockchain Marks the Next Step in the Internet’s Evolution - Wall Street Journal https://t.co/U6YmqK9cJH #Tech https://t.co/ooMi9Z5UDH", "lang": "en"}, {"text": "\"Wall Street Journal: The Fasting Cure Is No Fad\" via @FastingLane https://t.co/By0MkEV9w9", "lang": "en"}, {"text": "Wall Street Journal: If You Want ‘#Renewable Energy,’ Get Ready to Dig\nhttps://t.co/bvXH2qwmDM\n\"World demand for #RareEarths elements—which aren’t rare but are rarely mined in America—will rise 300% to 1,000% by 2050 to meet the Paris green goals.\" https://t.co/vbQQik9Sf4", "lang": "en"}, {"text": "every time i get a notification from the wall street journal opinion section i feel the sudden urge to throw myself off a bridge https://t.co/XgjcqeuxWC", "lang": "en"}, {"text": "Not many political leaders achieve success in winning hearts of people even from the opposition. Had one of the finest political careers and an excellent orator and human being. Rightly described by #WallStreetJournal as India's Best Loved Politician. RIP #sushmaswaraj ji 🙏", "lang": "en"}, {"text": "A small way that the president can help #ElPaso — he could pay his bill to the city, now up to $569,204.63. https://t.co/zpaeh7eovb by @davelevinthal @publicintegrity https://t.co/mV4n5He5dz", "lang": "en"}, {"text": "Chinese Troops in Hong Kong Keep Low Profile but Stand Ready – The Wall Street Journal https://t.co/I2tMxke4lT https://t.co/AJgWuZa3Mm", "lang": "en"}, {"text": "This week on Cultured, I talk all things #FastandFuriousHobbsandShaw, including that bizarre Wall Street Journal report about its stars and their contracts.\n\nListen here: https://t.co/WRvFWmbxBE https://t.co/kvOkSoDpWI", "lang": "en"}, {"text": "Another huge THANKS to my awesome readers! #6 on the Wall Street Journal bestseller list!!!! https://t.co/2qq4joUylV", "lang": "en"}, {"text": "GROUND ZERO come up at 4pm today on Invicta 98.9fm.\nSNIPPETS\n1- Sowore and Dadiyata abducted by unknown persons. ...As Nigerians call for their release\n2- Followingnthe wall street Journal reports the Nigerian Army Denies Existence Of Secret Graveyard Where 1000 Soldiers Buried https://t.co/3vi1zksQPX", "lang": "en"}, {"text": "Take an early look at the front page of The Wall Street Journal https://t.co/tYCeELTJqc https://t.co/aS4eIHAmvy", "lang": "en"}, {"text": "I felt like WEEPING after reading Wall Street Journal’s story of how General @MBuhari covered up the killing of 1000 troops by Boko Haram in the last one year by burying them at night. And 2 days ago, Buhari said he has 'defeated' Boko Haram!\n\n#GeneralBuhariSecretlyBuriesSoldiers", "lang": "en"}, {"text": "Wall Street Journal slaps Trump for latest stock market crippling tariffs that will hurt ‘innocent economic bystanders’ https://t.co/shJNJcB9xG https://t.co/HreiiXCDDQ", "lang": "en"}, {"text": "#Aftermath now a National Bestseller and Wall Street Journal Bestseller, #4 on hardcover business list: https://t.co/byU1OaoQCr. Thanks for your support! Book available here: https://t.co/kGeuucCJfl", "lang": "en"}, {"text": "@NateSilver538 Never thought I would see the day the NY Post and the Wall Street Journal would be more critical of Trump then the NYT", "lang": "en"}, {"text": "Rupert Murdoch's News Corp media empire has for decades been a source of gross distortion and denial of the #climatecrisis. Fox News, Wall Street Journal, The Times, The Sun, Sky, The Australian, ... Few carry more blame for our current predicament.   https://t.co/hoLwmZppK1", "lang": "en"}, {"text": "#WallStreetJournal editorial 5 August 2019: \"Gun rights need to be protected, but the Second Amendment is not a suicide pact.\" https://t.co/A4WkiLknc4", "lang": "en"}, {"text": "I just read two articles from the Wall Street journal and I feel soy fucking smart!! Like, current events? YAS I’m in that", "lang": "en"}, {"text": "Just having a clear out and here is a drawing of me as a 4-year-old, presumably during the days when I was working for the kids’ page of the Wall Street Journal. https://t.co/f1IoWgbM12", "lang": "en"}, {"text": "These 3 undated videos (1 min. 22 secs in all) of Nigerian soldiers battling what seem like Boko Haram terrorists with old, barefly functional guns tell you why our soldiers are sitting ducks for BH &amp; why they're hurriedly buried in mass, unmarked graves, as d Wall Street Journal https://t.co/G3mkgcLtVI", "lang": "en"}, {"text": "\"Launching a Leadership Revolution\" - NY Times, Wall Street Journal and USA Today best seller #leadership https://t.co/mhFIp3SIH9", "lang": "en"}, {"text": "13 #Investing books to read this summer according to the Wall Street Journal. #FinancialEducation\nhttps://t.co/bfsm1OsFhl https://t.co/jK6l6sYbda", "lang": "en"}, {"text": "Take an early look at the front page of The Wall Street Journal https://t.co/8XerKar8Dm https://t.co/FuOAXLynh5", "lang": "en"}, {"text": "This article appeared today in the Wall Street Journal.  Good ! https://t.co/aO0pARhJvd", "lang": "en"}, {"text": "The Defence Headquarters has noted with dismay an Online Article by “Wall Street Journal” purporting that the Nigerian Military maintains secret graveyards in the North East theatre of operation.", "lang": "en"}, {"text": "#India has lost a great &amp; humble leader. #sushmaswaraj  ji was called India's 'best-loved politician' by the US daily Wall Street Journal. https://t.co/jr1yofB1KR", "lang": "en"}, {"text": "Wall Street Journal\nhttps://t.co/5CqQULMlUI", "lang": "en"}, {"text": "Dan Draper, Managing Director of @InvescoUS, recommends The Bitcoin Standard to the Wall Street Journal's readers.\n\nhttps://t.co/tufVtocdCI", "lang": "en"}, {"text": "Hundreds arrested in Moscow as protests pile pressure on Putin  - The Wall Street Journal https://t.co/27EqbgQET8", "lang": "en"}, {"text": "thank you wall street journal, very cool! https://t.co/NpjlwiRbSC", "lang": "en"}, {"text": "The Wall Street Journal: Fox Corp. to buy majority stake in Credible Labs for $265 million https://t.co/JZiksGx8Xs #Business", "lang": "en"}, {"text": "https://t.co/2EOpJgAHUu A major expose about the #CFP Board of Standards was published in the #WallStreetJournal this week.  J.R. Robinson of  Financial Planning Hawaii helped develop the piece. Read more, right here...", "lang": "en"}, {"text": "Is Apple losing its bite? Headwinds for iPhone company - The Wall Street Journal - https://t.co/Ve9hcUIubi", "lang": "en"}, {"text": "“Just because you fail doesn’t mean you are a failure. It’s just a situation to overcome and transform.” Words to live by! Share the positivity of The Wall Street Journal best seller, The Coffee Bean and learn more https://t.co/aERdzHxros https://t.co/UBJPLtEv9U", "lang": "en"}, {"text": "So the Nigerian Army according to Wall Street Journal secretly buried about 1,000 soldiers? This Boko Haram defeat hen. Buhari is the greatest scam to ever plague this country. 🤦‍♂️", "lang": "en"}, {"text": "Take an early look at the front page of The Wall Street Journal https://t.co/JwoiaYlNRV https://t.co/jA5fLeQhsG", "lang": "en"}, {"text": "Wall Street Journal editorial board issues economic warning to Trump over his new China tariffs \n\nFirst Shep Smith at Fox and now, in short order, the Wall Street Journal comes out against @realDonaldTrump's China tariffs. This is utter Trump incompetence\n\nhttps://t.co/Q3jleeulSq https://t.co/pwI2n85OlV", "lang": "en"}, {"text": "⭐ #U.S. Levies New Sanctions Against Russia for U.K. Spy Poisoning - The Wall Street Journal ⭐ \nhttps://t.co/YU2zVLvmpr", "lang": "en"}, {"text": "If we composed a major article for the Time magazine or the Wall Street Journal newspaper, that would be the best illustrative stuff for the topic of upcoming #Turkey's offensive on #Kurds beyond #Euphrates river. https://t.co/DMBR1xRnWQ", "lang": "en"}, {"text": "HSBC to Slash Thousands of Jobs After Ousting CEO – The Wall Street Journal https://t.co/0RAzxGGVh4", "lang": "en"}, {"text": "FYI Austin tweeps- Today is my last day at @statesman so from here on out follow @PhilJankowski for all your #atxcouncil needs.\n\nAt the end of the month you'll be able to find me in Houston, writing all things Texas for the Wall Street Journal.", "lang": "en"}, {"text": "The @HQNigerianArmy cant be a judge in its own case. The allegation, by the Wall Street Journal @WSJ, that 1000 troops died since 2018 with many given secret burials must be investigate by a Judicial Panel. Our soldiers cant die like chickens\n\n#GeneralBuhariSecretlyBuriesSoldiers", "lang": "en"}, {"text": "Wall Street Journal: Data shows hundreds of suspicious social-media accounts targeted Senator Kamala Harris with conspiracy theories and divisive racial content during both Democratic debates.  https://t.co/YgREtcZZkc", "lang": "en"}, {"text": "Oophs! Another Burial Video Surfaces Discrediting 'The Wall Street Journal's Claim on Secret Military Cemetery in Maiduguri (Video) https://t.co/YMspmfHqzh \n@HQNigerianArmy @DefenceInfoNG @UN @DeptofDefense @CDS_Nig @WSJ @ONwachukwuDDI @SagirMusaDAPR @Buratai_COAS https://t.co/Mc21OUu0Vd", "lang": "en"}]